[
  {
    "job_name": "Designer",
    "category": "Arts, Design, and Creative",
    "job_description": "Designers are professionals who conceptualize, create, and implement visual or functional solutions across various industries. They combine creativity with technical skills to develop designs that meet specific needs, whether in graphic design, product design, fashion, interior spaces, or digital interfaces. Designers play a crucial role in enhancing aesthetics, usability, and user experience.",
    "eligibility": "Typically, a bachelor's degree in a relevant design field (e.g., Graphic Design, Industrial Design, Fashion Design, Interior Design, or UI/UX Design) is required. Some positions may accept candidates with diplomas or certifications, especially if accompanied by a strong portfolio. Proficiency in design software and tools pertinent to the specialization is essential.",
    "skills_required": [
      "Creativity and artistic ability",
      "Proficiency in design software (e.g., Adobe Creative Suite, Sketch, AutoCAD)",
      "Strong communication and presentation skills",
      "Attention to detail",
      "Problem-solving and critical thinking",
      "Understanding of color theory, typography, and layout",
      "Time management and ability to meet deadlines",
      "Adaptability to new trends and technologies"
    ],
    "education_path": [
      "Complete 10+2 with a focus on arts or science, depending on the design field",
      "Pursue a Bachelor's degree in a specific design discipline",
      "Optional: Obtain a Master's degree for advanced specialization",
      "Engage in internships and practical projects to build a portfolio"
    ],
    "related_exams": [
      "National Institute of Design (NID) Entrance Exam",
      "National Institute of Fashion Technology (NIFT) Entrance Exam",
      "Common Entrance Examination for Design (CEED)",
      "Undergraduate Common Entrance Examination for Design (UCEED)",
      "Symbiosis Entrance Exam for Design (SEED)"
    ],
    "career_growth": [
      "Junior Designer",
      "Mid-Level Designer",
      "Senior Designer",
      "Design Lead or Team Lead",
      "Art Director or Creative Director",
      "Head of Design or Chief Design Officer"
    ],
    "companies_hiring": [
      "Design agencies and studios",
      "Advertising and marketing firms",
      "Fashion houses and apparel brands",
      "Interior design and architecture firms",
      "Technology companies (for UI/UX designers)",
      "Manufacturing companies (for product designers)",
      "Media and publishing houses"
    ],
    "salary_range": "Entry-level designers can expect to earn between ₹2,00,000 to ₹4,00,000 per annum. Mid-level designers typically earn between ₹5,00,000 to ₹8,00,000 per annum. Senior designers and those in leadership roles can earn upwards of ₹10,00,000 per annum, depending on the industry and specialization."
  }
]