[
  {
    "job_name": "Journalist",
    "category": "Media and Communication",
    "job_description": "A journalist is responsible for researching, writing, and reporting news stories across various platforms such as print, television, radio, and online media. They gather information through interviews, investigations, and public records, and then report on events in an accurate and engaging manner. Journalists may specialize in fields such as politics, entertainment, sports, business, or technology, and work to inform the public, educate, and often hold people in power accountable.",
    "eligibility": "To become a journalist in India, candidates typically need to have completed 10+2 with a minimum of 50% marks in any stream. A Bachelor's degree in Journalism or Mass Communication is commonly pursued, followed by internships for practical experience. Some institutions may require entrance exams for admission into journalism programs.",
    "skills_required": [
      "Strong writing and editing skills",
      "Excellent research and investigative abilities",
      "Good interviewing and interpersonal skills",
      "Critical thinking and analytical skills",
      "Ability to work under tight deadlines",
      "Familiarity with digital media and social platforms",
      "Strong communication and presentation skills",
      "Attention to detail and accuracy",
      "Ethical decision-making and objectivity"
    ],
    "education_path": [
      "10+2 (preferably with a background in humanities or social science)",
      "Bachelor's degree in Journalism or Mass Communication",
      "Internships and practical writing experience",
      "Optional: Postgraduate degree in Journalism (M.Journalism) or related field"
    ],
    "related_exams": [
      "IIMC Entrance Exam (Indian Institute of Mass Communication)",
      "AJEE (Amity Journalism Entrance Exam)",
      "DU JAT (Delhi University Joint Admission Test)",
      "Symbiosis Entrance Test (SET) for Mass Communication",
      "JMI (Jamia Millia Islamia) Journalism Entrance Exam"
    ],
    "career_growth": [
      "Junior Reporter - Entry-level role in news reporting",
      "News Reporter - Covers specific news beats (e.g., politics, sports, entertainment)",
      "Senior Reporter/Correspondent - Covers major events or specialized fields",
      "Editor - Responsible for editorial content, decision-making, and managing a team of reporters",
      "Sub-Editor - Edits stories for grammar, style, and correctness",
      "News Anchor - Presents news stories on television or radio",
      "Investigative Journalist - Specializes in uncovering in-depth stories",
      "Editor-in-Chief - Heads a publication, oversees all editorial processes",
      "Media Consultant - Advises organizations on media relations and communication strategies"
    ],
    "companies_hiring": [
      "The Times of India",
      "NDTV",
      "CNN-News18",
      "Hindustan Times",
      "BBC News",
      "India Today",
      "The Hindu",
      "Reuters",
      "The Indian Express",
      "Press Information Bureau (PIB)"
    ],
    "salary_range": "₹3,00,000 to ₹8,00,000 per annum for entry-level to mid-career journalists. Senior journalists, editors, and reporters with experience can earn ₹10,00,000 or more annually, with some top journalists earning significantly higher, especially in large media outlets or specialized fields."
  }
]