[
  {
    "job_name": "Literature Professional",
    "category": "Arts, Media, and Education",
    "job_description": "A literature professional engages in the study, analysis, and interpretation of literary texts. They may work as writers, editors, educators, literary critics, or researchers, contributing to the preservation and dissemination of literary works. Their roles often involve critical thinking, effective communication, and a deep appreciation for language and storytelling.",
    "eligibility": "Typically, a Bachelor's degree in English Literature or a related field is required. Advanced positions may necessitate a Master's or Doctorate. Teaching roles often require additional certifications or licensure.",
    "skills_required": [
      "Strong analytical and critical thinking",
      "Excellent written and verbal communication",
      "Research proficiency",
      "Attention to detail",
      "Creative thinking",
      "Time management",
      "Adaptability to various literary genres and periods",
      "Proficiency in literary theory and criticism"
    ],
    "education_path": [
      "Complete 10+2 with a focus on humanities or arts",
      "Pursue a Bachelor's degree in English Literature or related field",
      "Optional: Master's degree for specialization or academic roles",
      "Optional: Doctorate for research or higher education teaching positions"
    ],
    "related_exams": [
      "Undergraduate entrance exams as per university requirements",
      "Postgraduate entrance exams like CUET-PG or university-specific tests",
      "NET/SET for eligibility in college-level teaching positions"
    ],
    "career_growth": [
      "Editorial Assistant",
      "Content Writer/Copywriter",
      "Literary Critic",
      "English Teacher/Professor",
      "Author/Novelist",
      "Publishing Editor",
      "Literary Agent",
      "Researcher in Literary Studies"
    ],
    "companies_hiring": [
      "Publishing Houses (e.g., Penguin Random House, HarperCollins)",
      "Educational Institutions",
      "Media and News Agencies",
      "Content Marketing Firms",
      "Non-Profit Organizations focusing on literacy",
      "Libraries and Archives",
      "Literary Magazines and Journals"
    ],
    "salary_range": "Entry-level positions may start at ₹3,00,000 per annum. With experience and advanced qualifications, professionals can earn upwards of ₹8,00,000 per annum. Academic and specialized roles may offer higher compensation."
  }
]